; ModuleID = '70hn50kgh2nd2uv0gn9vnsrw1'
source_filename = "70hn50kgh2nd2uv0gn9vnsrw1"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { %"alloc::raw_vec::RawVec<u8>", i64 }
%"alloc::raw_vec::RawVec<u8>" = type { %"alloc::raw_vec::RawVecInner", %"core::marker::PhantomData<u8>" }
%"alloc::raw_vec::RawVecInner" = type { i64, ptr, %"alloc::alloc::Global" }
%"alloc::alloc::Global" = type {}
%"core::marker::PhantomData<u8>" = type {}
%"core::fmt::rt::Argument<'_>" = type { %"core::fmt::rt::ArgumentType<'_>" }
%"core::fmt::rt::ArgumentType<'_>" = type { ptr, [1 x i64] }

@alloc_18d73aa062d524e9620b9e3b55bd9eb1 = private unnamed_addr constant [218 x i8] c"unsafe precondition(s) violated: slice::get_unchecked_mut requires that the range is within the slice\0A\0AThis indicates a bug in the program. This Undefined Behavior check is optional, and cannot be relied on for safety.", align 1
@alloc_31365cfefba383c4d2bf6b6a04cc10aa = private unnamed_addr constant [17 x i8] c"capacity overflow", align 1
@alloc_11d257f5ed6cc7fc38feaa801053bac6 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_31365cfefba383c4d2bf6b6a04cc10aa, [8 x i8] c"\11\00\00\00\00\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "8064bc08983504a6ce78632bfd86456e")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "71a15e6f95021d3e3793745eb243b771")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<alloc::string::String as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::String as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !34, templateParams: !23, identifier: "97e5a184078b025a821b7e394add0118")
!27 = !{!28, !29, !30, !31, !32, !33}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !35, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !37, templateParams: !23, identifier: "8e75393c7b0e9ef08a38af3d6b5d6ce")
!35 = !DINamespace(name: "string", scope: !36)
!36 = !DINamespace(name: "alloc", scope: null)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !34, file: !2, baseType: !39, size: 192, align: 64, flags: DIFlagPrivate)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !40, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !41, templateParams: !79, identifier: "beb0ac26597230c4f477b5c0bbc48dff")
!40 = !DINamespace(name: "vec", scope: !36)
!41 = !{!42, !80}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !2, baseType: !43, size: 128, align: 64, flags: DIFlagPrivate)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !44, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !45, templateParams: !79, identifier: "363ed510b409edd1c88242b58e428886")
!44 = !DINamespace(name: "raw_vec", scope: !36)
!45 = !{!46, !78}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !43, file: !2, baseType: !47, size: 128, align: 64, flags: DIFlagPrivate)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !44, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !48, templateParams: !76, identifier: "e1303878f8c5fefdc1ae3bfcf45170cb")
!48 = !{!49, !67, !73}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !47, file: !2, baseType: !50, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !51, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !54, templateParams: !62, identifier: "61bb115bd1de09a5f1741173c0d971f1")
!51 = !DINamespace(name: "unique", scope: !52)
!52 = !DINamespace(name: "ptr", scope: !53)
!53 = !DINamespace(name: "core", scope: null)
!54 = !{!55, !64}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !50, file: !2, baseType: !56, size: 64, align: 64, flags: DIFlagPrivate)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !58, templateParams: !62, identifier: "893628d23f0148f465f501bd0d65dadc")
!57 = !DINamespace(name: "non_null", scope: !52)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !56, file: !2, baseType: !60, size: 64, align: 64, flags: DIFlagPrivate)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!62 = !{!63}
!63 = !DITemplateTypeParameter(name: "T", type: !61)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !50, file: !2, baseType: !65, align: 8, offset: 64, flags: DIFlagPrivate)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !66, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !62, identifier: "f03c2432559681d34e7f5ec60128899b")
!66 = !DINamespace(name: "marker", scope: !53)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !47, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagPrivate)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "UsizeNoHighBit", scope: !69, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !71, templateParams: !23, identifier: "33a4be7cb9718269b90cb85d021dd94c")
!69 = !DINamespace(name: "niche_types", scope: !70)
!70 = !DINamespace(name: "num", scope: !53)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !47, file: !2, baseType: !74, align: 8, offset: 128, flags: DIFlagPrivate)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !75, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "7424cf13e22147b696b42b61097be783")
!75 = !DINamespace(name: "alloc", scope: !36)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "A", type: !74)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !43, file: !2, baseType: !65, align: 8, offset: 128, flags: DIFlagPrivate)
!79 = !{!63, !77}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !84, vtableHolder: !89, templateParams: !23, identifier: "4cbe567d68a2bf9468a5362aa5da089")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !83, file: !2, baseType: !6, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !83, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "<core::fmt::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !94, vtableHolder: !99, templateParams: !23, identifier: "82fc55b443fb56e67c01d0b03ff61b64")
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !93, file: !2, baseType: !6, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !93, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !93, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !100, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "d232e93bb259d35c17ab9546de2e3ee6")
!100 = !DINamespace(name: "fmt", scope: !53)
!101 = !{i32 8, !"PIC Level", i32 2}
!102 = !{i32 7, !"PIE Level", i32 2}
!103 = !{i32 2, !"RtLibUseGOT", i32 1}
!104 = !{i32 7, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{!"rustc version 1.88.0 (6b00bc388 2025-06-23)"}
!107 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !108, producer: "clang LLVM (rustc version 1.88.0 (6b00bc388 2025-06-23))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !109, globals: !184, splitDebugInlining: false, nameTableKind: None)
!108 = !DIFile(filename: "src/main.rs/@/70hn50kgh2nd2uv0gn9vnsrw1", directory: "/home/ordyboii/Public/rustbook/variables")
!109 = !{!110, !178}
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !111, file: !2, baseType: !112, size: 64, align: 64, flags: DIFlagEnumClass, elements: !113)
!111 = !DINamespace(name: "alignment", scope: !52)
!112 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!114 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !179, file: !2, baseType: !61, size: 8, align: 8, flags: DIFlagEnumClass, elements: !180)
!179 = !DINamespace(name: "panicking", scope: !53)
!180 = !{!181, !182, !183}
!181 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!182 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!183 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!184 = !{!0, !24, !81, !91}
!185 = distinct !DISubprogram(name: "fold<alloc::string::String, core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<alloc::string::String, alloc::vec::{impl#20}::extend_trusted::{closure_env#0}<alloc::string::String, alloc::alloc::Global, core::iter::adapters::map::Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h7ddcd6cc84702cbbE", scope: !187, file: !186, line: 124, type: !191, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !244, retainedNodes: !240)
!186 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "47fd4c3c8424e034238ec6bb5a169812")
!187 = !DINamespace(name: "{impl#2}", scope: !188)
!188 = !DINamespace(name: "map", scope: !189)
!189 = !DINamespace(name: "adapters", scope: !190)
!190 = !DINamespace(name: "iter", scope: !53)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193, !7, !219}
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>", scope: !188, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !194, templateParams: !216, identifier: "bfed1055107cfcd7044753d6cd0cb79")
!194 = !{!195, !212}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !193, file: !2, baseType: !196, size: 128, align: 64, flags: DIFlagProtected)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u32>", scope: !197, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !199, templateParams: !205, identifier: "f90692ad49d65f1a1236e3af7422dd61")
!197 = !DINamespace(name: "iter", scope: !198)
!198 = !DINamespace(name: "slice", scope: !53)
!199 = !{!200, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !196, file: !2, baseType: !201, size: 64, align: 64, flags: DIFlagPrivate)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u32>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !202, templateParams: !205, identifier: "65a1692f5cc89ee0ec96c3b647c91ece")
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !201, file: !2, baseType: !204, size: 64, align: 64, flags: DIFlagPrivate)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u32", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!205 = !{!206}
!206 = !DITemplateTypeParameter(name: "T", type: !90)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !196, file: !2, baseType: !204, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !196, file: !2, baseType: !209, align: 8, offset: 128, flags: DIFlagPrivate)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u32>", scope: !66, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !210, identifier: "328f0b3cfa137f911357c3aab62740")
!210 = !{!211}
!211 = !DITemplateTypeParameter(name: "T", type: !89)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !193, file: !2, baseType: !213, align: 8, offset: 128, flags: DIFlagPrivate)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !214, file: !2, align: 8, elements: !23, identifier: "7fa3988c146a3359a4b5b04faca3b91c")
!214 = !DINamespace(name: "fibonacci_sequence", scope: !215)
!215 = !DINamespace(name: "variables", scope: null)
!216 = !{!217, !218}
!217 = !DITemplateTypeParameter(name: "I", type: !196)
!218 = !DITemplateTypeParameter(name: "F", type: !213)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<alloc::string::String, alloc::vec::{impl#20}::extend_trusted::{closure_env#0}<alloc::string::String, alloc::alloc::Global, core::iter::adapters::map::Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>>>", scope: !220, file: !2, size: 192, align: 64, elements: !225, templateParams: !23, identifier: "6315310eadb38abf1075e7733f076694")
!220 = !DINamespace(name: "call", scope: !221)
!221 = !DINamespace(name: "for_each", scope: !222)
!222 = !DINamespace(name: "Iterator", scope: !223)
!223 = !DINamespace(name: "iterator", scope: !224)
!224 = !DINamespace(name: "traits", scope: !190)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !219, file: !2, baseType: !227, size: 192, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<alloc::string::String, alloc::alloc::Global, core::iter::adapters::map::Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>>", scope: !228, file: !2, size: 192, align: 64, elements: !230, templateParams: !23, identifier: "4b573d0fff92d0452694c201cb5df6dc")
!228 = !DINamespace(name: "extend_trusted", scope: !229)
!229 = !DINamespace(name: "{impl#20}", scope: !40)
!230 = !{!231, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !227, file: !2, baseType: !232, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::string::String", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "local_len", scope: !227, file: !2, baseType: !234, size: 128, align: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "SetLenOnDrop", scope: !235, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !236, templateParams: !23, identifier: "4b6e27e858f683ddc2b94a2cd7f30114")
!235 = !DINamespace(name: "set_len_on_drop", scope: !40)
!236 = !{!237, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !234, file: !2, baseType: !238, size: 64, align: 64, flags: DIFlagPrivate)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "local_len", scope: !234, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!240 = !{!241, !242, !243}
!241 = !DILocalVariable(name: "self", arg: 1, scope: !185, file: !186, line: 124, type: !193)
!242 = !DILocalVariable(name: "init", arg: 2, scope: !185, file: !186, line: 124, type: !7)
!243 = !DILocalVariable(name: "g", arg: 3, scope: !185, file: !186, line: 124, type: !219)
!244 = !{!245, !217, !218, !246, !247}
!245 = !DITemplateTypeParameter(name: "B", type: !34)
!246 = !DITemplateTypeParameter(name: "Acc", type: !7)
!247 = !DITemplateTypeParameter(name: "G", type: !219)
!248 = !DILocation(line: 124, column: 21, scope: !185)
!249 = !DILocation(line: 124, column: 27, scope: !185)
!250 = !DILocation(line: 124, column: 38, scope: !185)
!251 = !DILocalVariable(name: "g", arg: 2, scope: !252, file: !186, line: 86, type: !219)
!252 = distinct !DISubprogram(name: "map_fold<&u32, alloc::string::String, (), variables::fibonacci_sequence::{closure_env#0}, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<alloc::string::String, alloc::vec::{impl#20}::extend_trusted::{closure_env#0}<alloc::string::String, alloc::alloc::Global, core::iter::adapters::map::Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>>>>", linkageName: "_ZN4core4iter8adapters3map8map_fold17had2bf19ec861ec2dE", scope: !188, file: !186, line: 84, type: !253, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !262, retainedNodes: !260)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !213, !219}
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<&u32, alloc::string::String, (), variables::fibonacci_sequence::{closure_env#0}, core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<alloc::string::String, alloc::vec::{impl#20}::extend_trusted::{closure_env#0}<alloc::string::String, alloc::alloc::Global, core::iter::adapters::map::Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>>>>", scope: !256, file: !2, size: 192, align: 64, elements: !257, templateParams: !23, identifier: "545a5bc70950595dc614d7027d4edfce")
!256 = !DINamespace(name: "map_fold", scope: !188)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !255, file: !2, baseType: !219, size: 192, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !255, file: !2, baseType: !213, align: 8, offset: 192)
!260 = !{!261, !251}
!261 = !DILocalVariable(name: "f", arg: 1, scope: !252, file: !186, line: 85, type: !213)
!262 = !{!211, !245, !246, !263, !264}
!263 = !DITemplateTypeParameter(name: "impl FnMut(T) -> B", type: !213)
!264 = !DITemplateTypeParameter(name: "impl FnMut(Acc, B) -> Acc", type: !219)
!265 = !DILocation(line: 86, column: 5, scope: !252, inlinedAt: !266)
!266 = !DILocation(line: 128, column: 30, scope: !185)
!267 = !DILocation(line: 85, column: 5, scope: !252, inlinedAt: !266)
!268 = !DILocation(line: 88, column: 5, scope: !252, inlinedAt: !266)
!269 = !DILocation(line: 128, column: 9, scope: !185)
!270 = !DILocation(line: 129, column: 6, scope: !185)
!271 = distinct !DISubprogram(name: "size_hint<alloc::string::String, core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h3ffa7ca613f66c5aE", scope: !187, file: !186, line: 111, type: !272, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !295, retainedNodes: !293)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !292}
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 192, align: 64, elements: !275, templateParams: !23, identifier: "488f15a3f34ee00bee1eb331f1b644e3")
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !274, file: !2, baseType: !9, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !274, file: !2, baseType: !278, size: 128, align: 64, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !279, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !280, templateParams: !23, identifier: "1230ed0115aa5ef8341fe6b4d284c0a2")
!279 = !DINamespace(name: "option", scope: !53)
!280 = !{!281}
!281 = !DICompositeType(tag: DW_TAG_variant_part, scope: !278, file: !2, size: 128, align: 64, elements: !282, templateParams: !23, identifier: "ef790d344060d7c5bba9a15cf87a03a4", discriminator: !291)
!282 = !{!283, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !281, file: !2, baseType: !284, size: 128, align: 64, extraData: i64 0)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !278, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !285, identifier: "e5c543064651bc6aef4748e011c437")
!285 = !{!286}
!286 = !DITemplateTypeParameter(name: "T", type: !9)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !281, file: !2, baseType: !288, size: 128, align: 64, extraData: i64 1)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !278, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !289, templateParams: !285, identifier: "2f7fd69feb0a3d9761977d17e1f5372b")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !288, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!291 = !DIDerivedType(tag: DW_TAG_member, scope: !278, file: !2, baseType: !112, size: 64, align: 64, flags: DIFlagArtificial)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>", baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!293 = !{!294}
!294 = !DILocalVariable(name: "self", arg: 1, scope: !271, file: !186, line: 111, type: !292)
!295 = !{!245, !217, !218}
!296 = !DILocation(line: 111, column: 18, scope: !271)
!297 = !DILocation(line: 112, column: 9, scope: !271)
!298 = !DILocation(line: 113, column: 6, scope: !271)
!299 = distinct !DISubprogram(name: "precondition_check", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut18precondition_check17h9361b567bc89acc4E", scope: !301, file: !300, line: 66, type: !304, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !306)
!300 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ub_checks.rs", directory: "", checksumkind: CSK_MD5, checksum: "6ffce6e5ae865cd4e1a529f06e3329d2")
!301 = !DINamespace(name: "get_unchecked_mut", scope: !302)
!302 = !DINamespace(name: "{impl#4}", scope: !303)
!303 = !DINamespace(name: "index", scope: !198)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !9, !9, !9}
!306 = !{!307, !308, !309}
!307 = !DILocalVariable(name: "start", arg: 1, scope: !299, file: !300, line: 66, type: !9)
!308 = !DILocalVariable(name: "end", arg: 2, scope: !299, file: !300, line: 66, type: !9)
!309 = !DILocalVariable(name: "len", arg: 3, scope: !299, file: !300, line: 66, type: !9)
!310 = !DILocation(line: 66, column: 43, scope: !299)
!311 = !DILocation(line: 421, column: 18, scope: !312)
!312 = !DILexicalBlockFile(scope: !299, file: !313, discriminator: 0)
!313 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "baa2a238d3c3ce81e755e760737a6886")
!314 = !DILocation(line: 68, column: 21, scope: !299)
!315 = !DILocation(line: 421, column: 34, scope: !312)
!316 = !DILocation(line: 72, column: 14, scope: !299)
!317 = distinct !DISubprogram(name: "from_iter<alloc::string::String, core::iter::adapters::map::Map<core::slice::iter::Iter<u32>, variables::fibonacci_sequence::{closure_env#0}>>", linkageName: "_ZN111_$LT$alloc..vec..Vec$LT$T$GT$$u20$as$u20$alloc..vec..spec_from_iter_nested..SpecFromIterNested$LT$T$C$I$GT$$GT$9from_iter17h6cd1dac3112a4a07E", scope: !319, file: !318, line: 52, type: !321, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !354, retainedNodes: !348)
!318 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/alloc/src/vec/spec_from_iter_nested.rs", directory: "", checksumkind: CSK_MD5, checksum: "9676270e655d9a9d768f6949f90c4a85")
!319 = !DINamespace(name: "{impl#1}", scope: !320)
!320 = !DINamespace(name: "spec_from_iter_nested", scope: !40)
!321 = !DISubroutineType(types: !322)
!322 = !{!323, !193, !335}
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::string::String, alloc::alloc::Global>", scope: !40, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !324, templateParams: !333, identifier: "50099782d2403e39f7346b21ad420609")
!324 = !{!325, !334}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !323, file: !2, baseType: !326, size: 128, align: 64, flags: DIFlagPrivate)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::string::String, alloc::alloc::Global>", scope: !44, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !327, templateParams: !333, identifier: "fac6ecd7a338be8b4bbff4777f647c7")
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !326, file: !2, baseType: !47, size: 128, align: 64, flags: DIFlagPrivate)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !326, file: !2, baseType: !330, align: 8, offset: 128, flags: DIFlagPrivate)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::string::String>", scope: !66, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !331, identifier: "309bfb6c78c7bf569b7f199c74a8f0cc")
!331 = !{!332}
!332 = !DITemplateTypeParameter(name: "T", type: !34)
!333 = !{!332, !77}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !323, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !336, size: 64, align: 64, dwarfAddressSpace: 0)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !337, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !339, templateParams: !23, identifier: "f810f159f688041f878ac2315b306c2")
!337 = !DINamespace(name: "location", scope: !338)
!338 = !DINamespace(name: "panic", scope: !53)
!339 = !{!340, !346, !347}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !336, file: !2, baseType: !341, size: 128, align: 64, flags: DIFlagPrivate)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !342, templateParams: !23, identifier: "9277eecd40495f85161460476aacc992")
!342 = !{!343, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !341, file: !2, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !341, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !336, file: !2, baseType: !90, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !336, file: !2, baseType: !90, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!348 = !{!349, !350, !352}
!349 = !DILocalVariable(name: "iterator", arg: 1, scope: !317, file: !318, line: 52, type: !193)
!350 = !DILocalVariable(name: "vector", scope: !351, file: !318, line: 53, type: !323, align: 64)
!351 = distinct !DILexicalBlock(scope: !317, file: !318, line: 53, column: 9)
!352 = !DILocalVariable(name: "upper", scope: !353, file: !318, line: 54, type: !9, align: 64)
!353 = distinct !DILexicalBlock(scope: !317, file: !318, line: 54, column: 13)
!354 = !{!332, !355}
!355 = !DITemplateTypeParameter(name: "I", type: !193)
!356 = !DILocation(line: 52, column: 18, scope: !317)
!357 = !DILocation(line: 53, column: 13, scope: !351)
!358 = !DILocation(line: 234, column: 44, scope: !359, inlinedAt: !492)
!359 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt2rt38_$LT$impl$u20$core..fmt..Arguments$GT$9new_const17hc573b28f3f795a88E", scope: !361, file: !360, line: 234, type: !483, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, declaration: !489, retainedNodes: !490)
!360 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/fmt/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "7381de9e72522b8d4205e6c112dabcca")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !100, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !362, templateParams: !23, identifier: "4c6989df4542d01072a5b45c5ba9bc1e")
!362 = !{!363, !369, !411}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !361, file: !2, baseType: !364, size: 128, align: 64, flags: DIFlagPrivate)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !365, templateParams: !23, identifier: "4e66b00a376d6af5b8765440fb2839f")
!365 = !{!366, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !364, file: !2, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64, dwarfAddressSpace: 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !364, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !361, file: !2, baseType: !370, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !279, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !371, templateParams: !23, identifier: "7ae63775e8bcfa6a839bfcfe93c02aa9")
!371 = !{!372}
!372 = !DICompositeType(tag: DW_TAG_variant_part, scope: !370, file: !2, size: 128, align: 64, elements: !373, templateParams: !23, identifier: "27a112f63f03151c8b35341d9112ae2c", discriminator: !410)
!373 = !{!374, !406}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !372, file: !2, baseType: !375, size: 128, align: 64, extraData: i64 0)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !370, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !376, identifier: "cc0e9e61bdecb5015394c0febfd4db81")
!376 = !{!377}
!377 = !DITemplateTypeParameter(name: "T", type: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !379, templateParams: !23, identifier: "af315dd4afbb73e4a885f7d7f43165a")
!379 = !{!380, !405}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !378, file: !2, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64, dwarfAddressSpace: 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !383, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !384, templateParams: !23, identifier: "cd6afd9bbe8fc15817deae22b22a8572")
!383 = !DINamespace(name: "rt", scope: !100)
!384 = !{!385, !386, !387, !404}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !382, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !382, file: !2, baseType: !90, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !382, file: !2, baseType: !388, size: 128, align: 64, flags: DIFlagPublic)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !383, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !389, templateParams: !23, identifier: "d97bcd87965e4504e6e3355e23963ba9")
!389 = !{!390}
!390 = !DICompositeType(tag: DW_TAG_variant_part, scope: !388, file: !2, size: 128, align: 64, elements: !391, templateParams: !23, identifier: "9bd8da622a96f657b1a6bc75485f47b", discriminator: !403)
!391 = !{!392, !397, !401}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !390, file: !2, baseType: !393, size: 128, align: 64, extraData: i16 0)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !388, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !394, templateParams: !23, identifier: "17bfcb3941590da7384530ed3c799983")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !393, file: !2, baseType: !396, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!396 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !390, file: !2, baseType: !398, size: 128, align: 64, extraData: i16 1)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !388, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !399, templateParams: !23, identifier: "73c8a23858b47f6c934b23dfa5a36439")
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !398, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !390, file: !2, baseType: !402, size: 128, align: 64, extraData: i16 2)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !388, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, identifier: "64e0898bc328b611c771bc5cd130fca")
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !388, file: !2, baseType: !396, size: 16, align: 16, flags: DIFlagArtificial)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !382, file: !2, baseType: !388, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !378, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !372, file: !2, baseType: !407, size: 128, align: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !370, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !408, templateParams: !376, identifier: "7cc3f35f49c717d66771335210b1b847")
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !407, file: !2, baseType: !378, size: 128, align: 64, flags: DIFlagPublic)
!410 = !DIDerivedType(tag: DW_TAG_member, scope: !370, file: !2, baseType: !112, size: 64, align: 64, flags: DIFlagArtificial)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !361, file: !2, baseType: !412, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !413, templateParams: !23, identifier: "9884eb34dc138685ad2fbfb2726f4bd1")
!413 = !{!414, !482}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !412, file: !2, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !383, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !417, templateParams: !23, identifier: "e151d87b5a0008c97a3dc2a97c52edae")
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !416, file: !2, baseType: !419, size: 128, align: 64, flags: DIFlagPrivate)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !383, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !420, templateParams: !23, identifier: "f2f89015a2cda7876d723dd37d08fec1")
!420 = !{!421}
!421 = !DICompositeType(tag: DW_TAG_variant_part, scope: !419, file: !2, size: 128, align: 64, elements: !422, templateParams: !23, identifier: "299b0a91fc3f93ffb975a9cd95768ea9", discriminator: !481)
!422 = !{!423, !477}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !421, file: !2, baseType: !424, size: 128, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !419, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !425, templateParams: !23, identifier: "5c7cbc76057bd47f9ddcea4891f9ab1a")
!425 = !{!426, !432, !472}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !424, file: !2, baseType: !427, size: 64, align: 64, flags: DIFlagPrivate)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !57, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !428, templateParams: !430, identifier: "cb185686a53ea2cf1fd420de0a9ff6c")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !427, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!430 = !{!431}
!431 = !DITemplateTypeParameter(name: "T", type: !7)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !424, file: !2, baseType: !433, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !434, size: 64, align: 64, dwarfAddressSpace: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !427, !452}
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !437, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !438, templateParams: !23, identifier: "5b17e7e7818352912a473ed5915812f5")
!437 = !DINamespace(name: "result", scope: !53)
!438 = !{!439}
!439 = !DICompositeType(tag: DW_TAG_variant_part, scope: !436, file: !2, size: 8, align: 8, elements: !440, templateParams: !23, identifier: "7fa13ad3b8c7c519146d2fe722ce90f7", discriminator: !451)
!440 = !{!441, !447}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !439, file: !2, baseType: !442, size: 8, align: 8, extraData: i8 0)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !436, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !443, templateParams: !445, identifier: "cc8e1bc6a3afa0385507ad3968125b54")
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !442, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!445 = !{!431, !446}
!446 = !DITemplateTypeParameter(name: "E", type: !99)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !439, file: !2, baseType: !448, size: 8, align: 8, extraData: i8 1)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !436, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !449, templateParams: !445, identifier: "ca01282405f53f41cd1b33ccf230bcf")
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !448, file: !2, baseType: !99, align: 8, offset: 8, flags: DIFlagPublic)
!451 = !DIDerivedType(tag: DW_TAG_member, scope: !436, file: !2, baseType: !61, size: 8, align: 8, flags: DIFlagArtificial)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !453, size: 64, align: 64, dwarfAddressSpace: 0)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !100, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !454, templateParams: !23, identifier: "7d960a4bda06a5ce97a53fe36860a4f4")
!454 = !{!455, !461}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !453, file: !2, baseType: !456, size: 64, align: 32, offset: 128, flags: DIFlagPrivate)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !100, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !457, templateParams: !23, identifier: "37938bf3073c8472846af5f438b89b70")
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !456, file: !2, baseType: !90, size: 32, align: 32, flags: DIFlagPrivate)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !456, file: !2, baseType: !396, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !456, file: !2, baseType: !396, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !453, file: !2, baseType: !462, size: 128, align: 64, flags: DIFlagPrivate)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !463, templateParams: !23, identifier: "7d3e16104d7c2de9debe447176d7ddb3")
!463 = !{!464, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !462, file: !2, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64, dwarfAddressSpace: 0)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "2e79a1b22f9a6c8088d9260c09752d41")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !462, file: !2, baseType: !468, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !469, size: 64, align: 64, dwarfAddressSpace: 0)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 6, lowerBound: 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !424, file: !2, baseType: !473, align: 8, offset: 128, flags: DIFlagPrivate)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !66, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !474, identifier: "c5f18bc29b722815941edb4fef5102fe")
!474 = !{!475}
!475 = !DITemplateTypeParameter(name: "T", type: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !421, file: !2, baseType: !478, size: 128, align: 64, extraData: i64 0)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !419, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !479, templateParams: !23, identifier: "9d6dbac9c2afc576dc15bec92228d4a3")
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !478, file: !2, baseType: !396, size: 16, align: 16, offset: 64, flags: DIFlagPrivate)
!481 = !DIDerivedType(tag: DW_TAG_member, scope: !419, file: !2, baseType: !112, size: 64, align: 64, flags: DIFlagArtificial)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!361, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[&str; 1]", baseType: !486, size: 64, align: 64, dwarfAddressSpace: 0)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 128, align: 64, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 1, lowerBound: 0)
!489 = !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt2rt38_$LT$impl$u20$core..fmt..Arguments$GT$9new_const17hc573b28f3f795a88E", scope: !361, file: !360, line: 234, type: !483, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!490 = !{!491}
!491 = !DILocalVariable(name: "pieces", scope: !359, file: !360, line: 234, type: !485, align: 64)
!492 = !DILocation(line: 59, column: 18, scope: !317)
!493 = !DILocalVariable(name: "alloc", scope: !494, file: !495, line: 814, type: !74, align: 8)
!494 = distinct !DISubprogram(name: "with_capacity_in<alloc::string::String, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$16with_capacity_in17h469296124f54cd65E", scope: !323, file: !495, line: 814, type: !496, scopeLine: 814, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !333, declaration: !498, retainedNodes: !499)
!495 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/alloc/src/vec/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "80e502d080db0e742da5cfe26f320965")
!496 = !DISubroutineType(types: !497)
!497 = !{!323, !9, !74, !335}
!498 = !DISubprogram(name: "with_capacity_in<alloc::string::String, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$16with_capacity_in17h469296124f54cd65E", scope: !323, file: !495, line: 814, type: !496, scopeLine: 814, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !333)
!499 = !{!500, !493}
!500 = !DILocalVariable(name: "capacity", arg: 1, scope: !494, file: !495, line: 814, type: !9)
!501 = !DILocation(line: 814, column: 46, scope: !494, inlinedAt: !502)
!502 = !DILocation(line: 495, column: 9, scope: !503, inlinedAt: !509)
!503 = distinct !DISubprogram(name: "with_capacity<alloc::string::String>", linkageName: "_ZN5alloc3vec12Vec$LT$T$GT$13with_capacity17h66b3f0ad4cd9aa49E", scope: !323, file: !495, line: 494, type: !504, scopeLine: 494, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !331, declaration: !506, retainedNodes: !507)
!504 = !DISubroutineType(types: !505)
!505 = !{!323, !9, !335}
!506 = !DISubprogram(name: "with_capacity<alloc::string::String>", linkageName: "_ZN5alloc3vec12Vec$LT$T$GT$13with_capacity17h66b3f0ad4cd9aa49E", scope: !323, file: !495, line: 494, type: !504, scopeLine: 494, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !331)
!507 = !{!508}
!508 = !DILocalVariable(name: "capacity", arg: 1, scope: !503, file: !495, line: 494, type: !9)
!509 = !DILocation(line: 54, column: 33, scope: !353)
!510 = !DILocalVariable(name: "alloc", scope: !511, file: !512, line: 188, type: !74, align: 8)
!511 = distinct !DISubprogram(name: "with_capacity_in<alloc::string::String, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$16with_capacity_in17h6cf331ccab0a9227E", scope: !326, file: !512, line: 188, type: !513, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !333, declaration: !515, retainedNodes: !516)
!512 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/alloc/src/raw_vec/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c7a79316fa66f9db6f537ef3f1e3e10f")
!513 = !DISubroutineType(types: !514)
!514 = !{!326, !9, !74, !335}
!515 = !DISubprogram(name: "with_capacity_in<alloc::string::String, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$16with_capacity_in17h6cf331ccab0a9227E", scope: !326, file: !512, line: 188, type: !513, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !333)
!516 = !{!517, !510}
!517 = !DILocalVariable(name: "capacity", arg: 1, scope: !511, file: !512, line: 188, type: !9)
!518 = !DILocation(line: 188, column: 53, scope: !511, inlinedAt: !519)
!519 = !DILocation(line: 815, column: 20, scope: !494, inlinedAt: !502)
!520 = !DILocation(line: 53, column: 13, scope: !317)
!521 = !DILocation(line: 53, column: 32, scope: !317)
!522 = !DILocation(line: 64, column: 5, scope: !317)
!523 = !DILocation(line: 53, column: 26, scope: !317)
!524 = !DILocation(line: 54, column: 22, scope: !317)
!525 = !DILocation(line: 54, column: 22, scope: !353)
!526 = !DILocation(line: 494, column: 26, scope: !503, inlinedAt: !509)
!527 = !DILocation(line: 814, column: 29, scope: !494, inlinedAt: !502)
!528 = !DILocation(line: 188, column: 36, scope: !511, inlinedAt: !519)
!529 = !DILocation(line: 190, column: 20, scope: !511, inlinedAt: !519)
!530 = !DILocation(line: 236, column: 9, scope: !359, inlinedAt: !492)
!531 = !DILocation(line: 815, column: 9, scope: !494, inlinedAt: !502)
!532 = !DILocation(line: 62, column: 28, scope: !351)
!533 = !DILocation(line: 62, column: 9, scope: !351)
!534 = !DILocation(line: 63, column: 9, scope: !351)
!535 = !DILocation(line: 64, column: 6, scope: !317)
!536 = !DILocation(line: 52, column: 5, scope: !317)
!537 = distinct !DISubprogram(name: "from_residual<usize>", linkageName: "_ZN145_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..option..Option$LT$core..convert..Infallible$GT$$GT$$GT$13from_residual17h60ff51a2c2ccc921E", scope: !539, file: !538, line: 2527, type: !540, scopeLine: 2527, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !285, retainedNodes: !558)
!538 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "12ea85cfb8e24d6918cac95a535fe907")
!539 = !DINamespace(name: "{impl#41}", scope: !279)
!540 = !DISubroutineType(types: !541)
!541 = !{!278, !542}
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::convert::Infallible>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !543, templateParams: !23, identifier: "4bcc3f0d46aa8418ec950095b6f511e9")
!543 = !{!544}
!544 = !DICompositeType(tag: DW_TAG_variant_part, scope: !542, file: !2, align: 8, elements: !545, templateParams: !23, identifier: "7606b77a548d95984fe25591be456f49")
!545 = !{!546, !554}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !544, file: !2, baseType: !547, align: 8)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !542, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !548, identifier: "30986335d4d7fa05108b17db8fa0a62d")
!548 = !{!549}
!549 = !DITemplateTypeParameter(name: "T", type: !550)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !551, file: !2, align: 8, flags: DIFlagPublic, elements: !552, templateParams: !23, identifier: "c17908384fe21fd5a1c747e1ad83016")
!551 = !DINamespace(name: "convert", scope: !53)
!552 = !{!553}
!553 = !DICompositeType(tag: DW_TAG_variant_part, scope: !550, file: !2, align: 8, elements: !23, identifier: "d7397d1ec99614ad32e8c2877f22cc3a")
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !544, file: !2, baseType: !555, align: 8)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !542, file: !2, align: 8, flags: DIFlagPublic, elements: !556, templateParams: !548, identifier: "5eb43a4dddffe8bad3a8988f6d2a820a")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !555, file: !2, baseType: !550, align: 8, flags: DIFlagPublic)
!558 = !{!559}
!559 = !DILocalVariable(arg: 1, scope: !537, file: !538, line: 2527, type: !542)
!560 = !DILocation(line: 2527, column: 22, scope: !537)
!561 = !DILocation(line: 2529, column: 21, scope: !537)
!562 = !DILocation(line: 2531, column: 6, scope: !537)
!563 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h0e4b2f6a570fd303E", scope: !16, file: !564, line: 192, type: !565, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !430, retainedNodes: !569)
!564 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "d80971dcc3d7fe6d7c5aefe97934b9a9")
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !20, !567, !568, !61}
!567 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!569 = !{!570, !571, !572, !573}
!570 = !DILocalVariable(name: "main", arg: 1, scope: !563, file: !564, line: 193, type: !20)
!571 = !DILocalVariable(name: "argc", arg: 2, scope: !563, file: !564, line: 194, type: !567)
!572 = !DILocalVariable(name: "argv", arg: 3, scope: !563, file: !564, line: 195, type: !568)
!573 = !DILocalVariable(name: "sigpipe", arg: 4, scope: !563, file: !564, line: 196, type: !61)
!574 = !DILocation(line: 193, column: 5, scope: !563)
!575 = !DILocation(line: 194, column: 5, scope: !563)
!576 = !DILocation(line: 195, column: 5, scope: !563)
!577 = !DILocation(line: 196, column: 5, scope: !563)
!578 = !DILocation(line: 199, column: 10, scope: !563)
!579 = !DILocation(line: 198, column: 5, scope: !563)
!580 = !DILocation(line: 204, column: 2, scope: !563)
!581 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h7bca82e2071632c2E", scope: !15, file: !564, line: 199, type: !582, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !430, retainedNodes: !586)
!582 = !DISubroutineType(types: !583)
!583 = !{!584, !585}
!584 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!586 = !{!587}
!587 = !DILocalVariable(name: "main", scope: !581, file: !564, line: 193, type: !20, align: 64)
!588 = !DILocation(line: 193, column: 5, scope: !581)
!589 = !DILocation(line: 199, column: 70, scope: !581)
!590 = !DILocation(line: 199, column: 18, scope: !581)
!591 = !DILocalVariable(name: "self", arg: 1, scope: !592, file: !593, line: 2150, type: !594)
!592 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217had2bd51d6bbc1804E", scope: !594, file: !593, line: 2150, type: !605, scopeLine: 2150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, declaration: !607, retainedNodes: !608)
!593 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "8411961c8d9bc7a1e09c200c4fd3dfa3")
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !595, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !596, templateParams: !23, identifier: "2dbebe2615a80a006799eade9e05c57")
!595 = !DINamespace(name: "process", scope: !17)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !594, file: !2, baseType: !598, size: 8, align: 8, flags: DIFlagPrivate)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !599, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !603, templateParams: !23, identifier: "a61419cf5563823894aa8ed95640d8c6")
!599 = !DINamespace(name: "common", scope: !600)
!600 = !DINamespace(name: "unix", scope: !601)
!601 = !DINamespace(name: "process", scope: !602)
!602 = !DINamespace(name: "sys", scope: !17)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !598, file: !2, baseType: !61, size: 8, align: 8, flags: DIFlagPrivate)
!605 = !DISubroutineType(types: !606)
!606 = !{!584, !594}
!607 = !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217had2bd51d6bbc1804E", scope: !594, file: !593, line: 2150, type: !605, scopeLine: 2150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!608 = !{!591}
!609 = !DILocation(line: 2150, column: 19, scope: !592, inlinedAt: !610)
!610 = !DILocation(line: 199, column: 85, scope: !581)
!611 = !DILocation(line: 637, column: 9, scope: !612, inlinedAt: !618)
!612 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys7process4unix6common8ExitCode6as_i3217h5c21c8f99b26a812E", scope: !598, file: !613, line: 636, type: !614, scopeLine: 636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, declaration: !617)
!613 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/sys/process/unix/common.rs", directory: "", checksumkind: CSK_MD5, checksum: "ff0d8b36c834a5d38d940b23364e2392")
!614 = !DISubroutineType(types: !615)
!615 = !{!584, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::process::unix::common::ExitCode", baseType: !598, size: 64, align: 64, dwarfAddressSpace: 0)
!617 = !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys7process4unix6common8ExitCode6as_i3217h5c21c8f99b26a812E", scope: !598, file: !613, line: 636, type: !614, scopeLine: 636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!618 = !DILocation(line: 2151, column: 16, scope: !592, inlinedAt: !610)
!619 = !DILocation(line: 199, column: 93, scope: !581)
!620 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std3sys9backtrace28__rust_begin_short_backtrace17h5d36bea90cfefb88E", scope: !622, file: !621, line: 148, type: !623, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !629, retainedNodes: !625)
!621 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/sys/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e30c70624c3cf40238860e740bd696f")
!622 = !DINamespace(name: "backtrace", scope: !602)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !20}
!625 = !{!626, !627}
!626 = !DILocalVariable(name: "f", arg: 1, scope: !620, file: !621, line: 148, type: !20)
!627 = !DILocalVariable(name: "result", scope: !628, file: !621, line: 152, type: !7, align: 8)
!628 = distinct !DILexicalBlock(scope: !620, file: !621, line: 152, column: 5)
!629 = !{!630, !431}
!630 = !DITemplateTypeParameter(name: "F", type: !20)
!631 = !DILocation(line: 152, column: 9, scope: !628)
!632 = !DILocation(line: 148, column: 43, scope: !620)
!633 = !DILocalVariable(name: "dummy", scope: !634, file: !635, line: 481, type: !7, align: 8)
!634 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h2f298405b07d025fE", scope: !636, file: !635, line: 481, type: !637, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !430, retainedNodes: !639)
!635 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "926720c47ebb907d54d2662c4d7d0776")
!636 = !DINamespace(name: "hint", scope: !53)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !7}
!639 = !{!633}
!640 = !DILocation(line: 481, column: 27, scope: !634, inlinedAt: !641)
!641 = !DILocation(line: 155, column: 5, scope: !628)
!642 = !DILocation(line: 152, column: 18, scope: !620)
!643 = !DILocation(line: 482, column: 5, scope: !634, inlinedAt: !641)
!644 = !{i64 16278480106411278}
!645 = !DILocation(line: 158, column: 2, scope: !620)
!646 = distinct !DISubprogram(name: "fmt<u32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h604aa6ac4e2b7f9cE", scope: !648, file: !647, line: 2636, type: !649, scopeLine: 2636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, retainedNodes: !652)
!647 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "87c34108250d7f4c9dd8d845bd1b703d")
!648 = !DINamespace(name: "{impl#73}", scope: !100)
!649 = !DISubroutineType(types: !650)
!650 = !{!436, !651, !452}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u32", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!652 = !{!653, !654}
!653 = !DILocalVariable(name: "self", arg: 1, scope: !646, file: !647, line: 2636, type: !651)
!654 = !DILocalVariable(name: "f", arg: 2, scope: !646, file: !647, line: 2636, type: !452)
!655 = !DILocation(line: 2636, column: 20, scope: !646)
!656 = !DILocation(line: 2636, column: 27, scope: !646)
!657 = !DILocation(line: 2636, column: 71, scope: !646)
!658 = !DILocation(line: 2636, column: 62, scope: !646)
!659 = !DILocation(line: 2636, column: 84, scope: !646)
!660 = distinct !DISubprogram(name: "to_string<u32>", linkageName: "_ZN45_$LT$T$u20$as$u20$alloc..string..ToString$GT$9to_string17h3ee06f2d717a5f76E", scope: !662, file: !661, line: 2777, type: !663, scopeLine: 2777, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, retainedNodes: !665)
!661 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "89205ffd77b3d152fe58be46fa02a6f8")
!662 = !DINamespace(name: "{impl#34}", scope: !35)
!663 = !DISubroutineType(types: !664)
!664 = !{!34, !89}
!665 = !{!666}
!666 = !DILocalVariable(name: "self", arg: 1, scope: !660, file: !661, line: 2777, type: !89)
!667 = !DILocation(line: 2777, column: 18, scope: !660)
!668 = !DILocation(line: 2778, column: 9, scope: !660)
!669 = !DILocation(line: 2779, column: 6, scope: !660)
!670 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN47_$LT$u32$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17hab588e00b7cf7ac9E", scope: !672, file: !671, line: 203, type: !674, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !676)
!671 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "8b5a8ebe964faccd1cc90899a7d1b207")
!672 = !DINamespace(name: "{impl#39}", scope: !673)
!673 = !DINamespace(name: "range", scope: !190)
!674 = !DISubroutineType(types: !675)
!675 = !{!90, !90, !9}
!676 = !{!677, !678}
!677 = !DILocalVariable(name: "start", arg: 1, scope: !670, file: !671, line: 203, type: !90)
!678 = !DILocalVariable(name: "n", arg: 2, scope: !670, file: !671, line: 203, type: !9)
!679 = !DILocation(line: 203, column: 37, scope: !670)
!680 = !DILocalVariable(name: "self", arg: 1, scope: !681, file: !682, line: 605, type: !90)
!681 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u32$GT$13unchecked_add17h1d27024007a68ccfE", scope: !683, file: !682, line: 605, type: !684, scopeLine: 605, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !686)
!682 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "808b6d8f4f9247ae56e793f1af19e2e9")
!683 = !DINamespace(name: "{impl#8}", scope: !70)
!684 = !DISubroutineType(types: !685)
!685 = !{!90, !90, !90}
!686 = !{!680, !687}
!687 = !DILocalVariable(name: "rhs", arg: 2, scope: !681, file: !682, line: 605, type: !90)
!688 = !DILocation(line: 605, column: 43, scope: !681, inlinedAt: !689)
!689 = !DILocation(line: 205, column: 28, scope: !670)
!690 = !DILocation(line: 203, column: 50, scope: !670)
!691 = !DILocation(line: 205, column: 42, scope: !670)
!692 = !DILocation(line: 605, column: 49, scope: !681, inlinedAt: !689)
!693 = !DILocation(line: 74, column: 35, scope: !694, inlinedAt: !689)
!694 = !DILexicalBlockFile(scope: !681, file: !300, discriminator: 0)
!695 = !DILocation(line: 75, column: 17, scope: !694, inlinedAt: !689)
!696 = !DILocation(line: 617, column: 17, scope: !681, inlinedAt: !689)
!697 = !DILocation(line: 206, column: 10, scope: !670)
!698 = distinct !DISubprogram(name: "fmt<u32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17h2485be3502a00e3eE", scope: !699, file: !647, line: 2891, type: !700, scopeLine: 2891, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, retainedNodes: !707)
!699 = !DINamespace(name: "{impl#28}", scope: !100)
!700 = !DISubroutineType(types: !701)
!701 = !{!436, !702, !452}
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u32]", file: !2, size: 128, align: 64, elements: !703, templateParams: !23, identifier: "467923a08fc75332ca53cdba7e9dfffc")
!703 = !{!704, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !702, file: !2, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !702, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!707 = !{!708, !709}
!708 = !DILocalVariable(name: "self", arg: 1, scope: !698, file: !647, line: 2891, type: !702)
!709 = !DILocalVariable(name: "f", arg: 2, scope: !698, file: !647, line: 2891, type: !452)
!710 = !DILocation(line: 2891, column: 12, scope: !698)
!711 = !DILocalVariable(name: "self", arg: 1, scope: !712, file: !713, line: 1029, type: !702)
!712 = distinct !DISubprogram(name: "iter<u32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17hb480f097a730ea76E", scope: !714, file: !713, line: 1029, type: !715, scopeLine: 1029, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, retainedNodes: !717)
!713 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "2d918a6f3598a09ed04bec293b0c534b")
!714 = !DINamespace(name: "{impl#0}", scope: !198)
!715 = !DISubroutineType(types: !716)
!716 = !{!196, !702}
!717 = !{!711}
!718 = !DILocation(line: 1029, column: 23, scope: !712, inlinedAt: !719)
!719 = !DILocation(line: 2892, column: 37, scope: !698)
!720 = !DILocalVariable(name: "slice", arg: 1, scope: !721, file: !722, line: 96, type: !702)
!721 = distinct !DISubprogram(name: "new<u32>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h119db15be3a66387E", scope: !196, file: !722, line: 96, type: !715, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, declaration: !723, retainedNodes: !724)
!722 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "215db49d603ba4b7da5c29f81e6e67eb")
!723 = !DISubprogram(name: "new<u32>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h119db15be3a66387E", scope: !196, file: !722, line: 96, type: !715, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !205)
!724 = !{!720, !725, !727, !729}
!725 = !DILocalVariable(name: "len", scope: !726, file: !722, line: 97, type: !9, align: 64)
!726 = distinct !DILexicalBlock(scope: !721, file: !722, line: 97, column: 9)
!727 = !DILocalVariable(name: "ptr", scope: !728, file: !722, line: 98, type: !201, align: 64)
!728 = distinct !DILexicalBlock(scope: !726, file: !722, line: 98, column: 9)
!729 = !DILocalVariable(name: "end_or_len", scope: !730, file: !722, line: 101, type: !204, align: 64)
!730 = distinct !DILexicalBlock(scope: !728, file: !722, line: 101, column: 13)
!731 = !DILocation(line: 96, column: 29, scope: !721, inlinedAt: !732)
!732 = !DILocation(line: 1030, column: 9, scope: !712, inlinedAt: !719)
!733 = !DILocalVariable(name: "r", arg: 1, scope: !734, file: !735, line: 267, type: !702)
!734 = distinct !DISubprogram(name: "from_ref<[u32]>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$8from_ref17hda271c78342f1a97E", scope: !736, file: !735, line: 267, type: !743, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, declaration: !745, retainedNodes: !746)
!735 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "4581535087e72f009ff006c7c6f156b9")
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<[u32]>", scope: !57, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !737, templateParams: !205, identifier: "62ec0a0fd89461e59a7e692755352c3")
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !736, file: !2, baseType: !739, size: 128, align: 64, flags: DIFlagPrivate)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u32]", file: !2, size: 128, align: 64, elements: !740, templateParams: !23, identifier: "665cd45c36d251681024897c1a3316cd")
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !739, file: !2, baseType: !705, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !739, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!736, !702}
!745 = !DISubprogram(name: "from_ref<[u32]>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$8from_ref17hda271c78342f1a97E", scope: !736, file: !735, line: 267, type: !743, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !205)
!746 = !{!733}
!747 = !DILocation(line: 267, column: 27, scope: !734, inlinedAt: !748)
!748 = !DILocation(line: 98, column: 31, scope: !726, inlinedAt: !732)
!749 = !DILocation(line: 2891, column: 19, scope: !698)
!750 = !DILocation(line: 101, column: 17, scope: !730, inlinedAt: !732)
!751 = !DILocation(line: 2892, column: 9, scope: !698)
!752 = !DILocation(line: 97, column: 19, scope: !721, inlinedAt: !732)
!753 = !DILocation(line: 97, column: 13, scope: !726, inlinedAt: !732)
!754 = !DILocalVariable(name: "addr", arg: 1, scope: !755, file: !756, line: 599, type: !9)
!755 = distinct !DISubprogram(name: "without_provenance<u32>", linkageName: "_ZN4core3ptr18without_provenance17h58edfce156c667ceE", scope: !52, file: !756, line: 599, type: !757, scopeLine: 599, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, retainedNodes: !759)
!756 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "015cf1db47a5b206bdc77da7f59325dd")
!757 = !DISubroutineType(types: !758)
!758 = !{!204, !9}
!759 = !{!754}
!760 = !DILocation(line: 599, column: 36, scope: !755, inlinedAt: !761)
!761 = !DILocation(line: 102, column: 32, scope: !728, inlinedAt: !732)
!762 = !DILocalVariable(name: "count", arg: 2, scope: !763, file: !764, line: 1022, type: !9)
!763 = distinct !DISubprogram(name: "add<u32>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17h7b26c981e0855327E", scope: !765, file: !764, line: 1022, type: !767, scopeLine: 1022, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, retainedNodes: !770)
!764 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "135dbc432f18556357bf189d39336fde")
!765 = !DINamespace(name: "{impl#0}", scope: !766)
!766 = !DINamespace(name: "mut_ptr", scope: !52)
!767 = !DISubroutineType(types: !768)
!768 = !{!769, !769, !9}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u32", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!770 = !{!771, !762}
!771 = !DILocalVariable(name: "self", arg: 1, scope: !763, file: !764, line: 1022, type: !769)
!772 = !DILocation(line: 1022, column: 35, scope: !763, inlinedAt: !773)
!773 = !DILocation(line: 102, column: 78, scope: !728, inlinedAt: !732)
!774 = !DILocation(line: 269, column: 18, scope: !734, inlinedAt: !748)
!775 = !DILocalVariable(name: "self", arg: 1, scope: !776, file: !735, line: 486, type: !736)
!776 = distinct !DISubprogram(name: "cast<[u32], u32>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$4cast17h89a24a102361ca12E", scope: !736, file: !735, line: 486, type: !777, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !780, declaration: !779, retainedNodes: !782)
!777 = !DISubroutineType(types: !778)
!778 = !{!201, !736}
!779 = !DISubprogram(name: "cast<[u32], u32>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$4cast17h89a24a102361ca12E", scope: !736, file: !735, line: 486, type: !777, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !780)
!780 = !{!206, !781}
!781 = !DITemplateTypeParameter(name: "U", type: !90)
!782 = !{!775}
!783 = !DILocation(line: 486, column: 26, scope: !776, inlinedAt: !784)
!784 = !DILocation(line: 98, column: 56, scope: !726, inlinedAt: !732)
!785 = !DILocation(line: 488, column: 18, scope: !776, inlinedAt: !784)
!786 = !DILocation(line: 98, column: 13, scope: !728, inlinedAt: !732)
!787 = !DILocalVariable(name: "self", arg: 1, scope: !788, file: !735, line: 385, type: !201)
!788 = distinct !DISubprogram(name: "as_ptr<u32>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17hbb61f0329fa08f65E", scope: !201, file: !735, line: 385, type: !789, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, declaration: !791, retainedNodes: !792)
!789 = !DISubroutineType(types: !790)
!790 = !{!769, !201}
!791 = !DISubprogram(name: "as_ptr<u32>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17hbb61f0329fa08f65E", scope: !201, file: !735, line: 385, type: !789, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !205)
!792 = !{!787}
!793 = !DILocation(line: 385, column: 25, scope: !788, inlinedAt: !794)
!794 = !DILocation(line: 102, column: 69, scope: !728, inlinedAt: !732)
!795 = !DILocation(line: 102, column: 20, scope: !728, inlinedAt: !732)
!796 = !DILocation(line: 391, column: 18, scope: !788, inlinedAt: !794)
!797 = !DILocation(line: 1022, column: 29, scope: !763, inlinedAt: !773)
!798 = !DILocation(line: 1056, column: 18, scope: !763, inlinedAt: !773)
!799 = !DILocation(line: 102, column: 63, scope: !728, inlinedAt: !732)
!800 = !DILocation(line: 102, column: 17, scope: !728, inlinedAt: !732)
!801 = !DILocation(line: 104, column: 25, scope: !730, inlinedAt: !732)
!802 = !DILocation(line: 2893, column: 6, scope: !698)
!803 = distinct !DISubprogram(name: "spec_to_string<u32>", linkageName: "_ZN49_$LT$T$u20$as$u20$alloc..string..SpecToString$GT$14spec_to_string17hbd2169576e296684E", scope: !804, file: !661, line: 2794, type: !663, scopeLine: 2794, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !205, retainedNodes: !805)
!804 = !DINamespace(name: "{impl#35}", scope: !35)
!805 = !{!806, !807, !809}
!806 = !DILocalVariable(name: "self", arg: 1, scope: !803, file: !661, line: 2794, type: !89)
!807 = !DILocalVariable(name: "buf", scope: !808, file: !661, line: 2795, type: !34, align: 64)
!808 = distinct !DILexicalBlock(scope: !803, file: !661, line: 2795, column: 9)
!809 = !DILocalVariable(name: "formatter", scope: !810, file: !661, line: 2796, type: !453, align: 64)
!810 = distinct !DILexicalBlock(scope: !808, file: !661, line: 2796, column: 9)
!811 = !DILocation(line: 2794, column: 31, scope: !803)
!812 = !DILocation(line: 2795, column: 13, scope: !808)
!813 = !DILocation(line: 2796, column: 13, scope: !810)
!814 = !DILocalVariable(name: "options", arg: 2, scope: !815, file: !647, line: 577, type: !456)
!815 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core3fmt9Formatter3new17hed2f67b142aaac19E", scope: !453, file: !647, line: 577, type: !816, scopeLine: 577, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, declaration: !818, retainedNodes: !819)
!816 = !DISubroutineType(types: !817)
!817 = !{!453, !462, !456}
!818 = !DISubprogram(name: "new", linkageName: "_ZN4core3fmt9Formatter3new17hed2f67b142aaac19E", scope: !453, file: !647, line: 577, type: !816, scopeLine: 577, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!819 = !{!820, !814}
!820 = !DILocalVariable(name: "write", arg: 1, scope: !815, file: !647, line: 577, type: !462)
!821 = !DILocation(line: 577, column: 49, scope: !815, inlinedAt: !822)
!822 = !DILocation(line: 2797, column: 13, scope: !808)
!823 = !DILocation(line: 435, column: 9, scope: !824, inlinedAt: !828)
!824 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN5alloc3vec12Vec$LT$T$GT$3new17hae7f6f4bb110d6c7E", scope: !39, file: !495, line: 434, type: !825, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !62, declaration: !827)
!825 = !DISubroutineType(types: !826)
!826 = !{!39}
!827 = !DISubprogram(name: "new<u8>", linkageName: "_ZN5alloc3vec12Vec$LT$T$GT$3new17hae7f6f4bb110d6c7E", scope: !39, file: !495, line: 434, type: !825, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !62)
!828 = !DILocation(line: 445, column: 23, scope: !829, inlinedAt: !833)
!829 = distinct !DISubprogram(name: "new", linkageName: "_ZN5alloc6string6String3new17h686dfa39f03da5f2E", scope: !34, file: !661, line: 444, type: !830, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, declaration: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!34}
!832 = !DISubprogram(name: "new", linkageName: "_ZN5alloc6string6String3new17h686dfa39f03da5f2E", scope: !34, file: !661, line: 444, type: !830, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!833 = !DILocation(line: 2795, column: 23, scope: !803)
!834 = !DILocation(line: 445, column: 9, scope: !829, inlinedAt: !833)
!835 = !DILocation(line: 2797, column: 39, scope: !808)
!836 = !DILocation(line: 577, column: 16, scope: !815, inlinedAt: !822)
!837 = !DILocation(line: 342, column: 9, scope: !838, inlinedAt: !842)
!838 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core3fmt17FormattingOptions3new17ha160a63d09d9ae50E", scope: !456, file: !647, line: 341, type: !839, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, declaration: !841)
!839 = !DISubroutineType(types: !840)
!840 = !{!456}
!841 = !DISubprogram(name: "new", linkageName: "_ZN4core3fmt17FormattingOptions3new17ha160a63d09d9ae50E", scope: !456, file: !647, line: 341, type: !839, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!842 = !DILocation(line: 2797, column: 49, scope: !808)
!843 = !DILocation(line: 578, column: 9, scope: !815, inlinedAt: !822)
!844 = !DILocation(line: 2799, column: 9, scope: !810)
!845 = !DILocation(line: 2802, column: 5, scope: !803)
!846 = !DILocation(line: 2801, column: 9, scope: !810)
!847 = !DILocation(line: 2802, column: 6, scope: !803)
!848 = !DILocation(line: 2794, column: 5, scope: !803)
!849 = distinct !DISubprogram(name: "precondition_check", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping18precondition_check17hc81675b7eb28c56aE", scope: !850, file: !300, line: 66, type: !852, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !855)
!850 = !DINamespace(name: "copy_nonoverlapping", scope: !851)
!851 = !DINamespace(name: "intrinsics", scope: !53)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !6, !854, !9, !9, !9}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!855 = !{!856, !857, !858, !859, !860, !861}
!856 = !DILocalVariable(name: "src", arg: 1, scope: !849, file: !300, line: 66, type: !6)
!857 = !DILocalVariable(name: "dst", arg: 2, scope: !849, file: !300, line: 66, type: !854)
!858 = !DILocalVariable(name: "size", arg: 3, scope: !849, file: !300, line: 66, type: !9)
!859 = !DILocalVariable(name: "align", arg: 4, scope: !849, file: !300, line: 66, type: !9)
!860 = !DILocalVariable(name: "count", arg: 5, scope: !849, file: !300, line: 66, type: !9)
!861 = !DILocalVariable(name: "zero_size", scope: !862, file: !863, line: 3744, type: !864, align: 8)
!862 = distinct !DILexicalBlock(scope: !849, file: !863, line: 3744, column: 13)
!863 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/intrinsics/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "49afd57ce0629b2532f1104468e9c953")
!864 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!865 = !DILocation(line: 66, column: 43, scope: !849)
!866 = !DILocalVariable(name: "ptr", arg: 1, scope: !867, file: !300, line: 117, type: !6)
!867 = distinct !DISubprogram(name: "maybe_is_aligned_and_not_null", linkageName: "_ZN4core9ub_checks29maybe_is_aligned_and_not_null17he118617f1ce33dfaE", scope: !868, file: !300, line: 116, type: !869, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !871)
!868 = !DINamespace(name: "ub_checks", scope: !53)
!869 = !DISubroutineType(types: !870)
!870 = !{!864, !6, !9, !864}
!871 = !{!866, !872, !873}
!872 = !DILocalVariable(name: "align", arg: 2, scope: !867, file: !300, line: 118, type: !9)
!873 = !DILocalVariable(name: "is_zst", arg: 3, scope: !867, file: !300, line: 119, type: !864)
!874 = !DILocation(line: 117, column: 5, scope: !867, inlinedAt: !875)
!875 = !DILocation(line: 3745, column: 13, scope: !862)
!876 = !DILocalVariable(name: "ptr", arg: 1, scope: !877, file: !863, line: 3184, type: !6)
!877 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core9ub_checks29maybe_is_aligned_and_not_null7runtime17hccc36822ca83588fE", scope: !878, file: !863, line: 3184, type: !869, scopeLine: 3184, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !879)
!878 = !DINamespace(name: "maybe_is_aligned_and_not_null", scope: !868)
!879 = !{!876, !880, !881}
!880 = !DILocalVariable(name: "align", arg: 2, scope: !877, file: !863, line: 3184, type: !9)
!881 = !DILocalVariable(name: "is_zst", arg: 3, scope: !877, file: !863, line: 3184, type: !864)
!882 = !DILocation(line: 3184, column: 40, scope: !877, inlinedAt: !883)
!883 = !DILocation(line: 3196, column: 9, scope: !884, inlinedAt: !875)
!884 = !DILexicalBlockFile(scope: !867, file: !863, discriminator: 0)
!885 = !DILocalVariable(name: "self", arg: 1, scope: !886, file: !887, line: 1474, type: !6)
!886 = distinct !DISubprogram(name: "is_aligned_to<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to17ha637b8131f2df0dcE", scope: !888, file: !887, line: 1474, type: !890, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !430, retainedNodes: !892)
!887 = !DIFile(filename: "/home/ordyboii/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "0ead557bf767918d6cdf7616e09c93bd")
!888 = !DINamespace(name: "{impl#0}", scope: !889)
!889 = !DINamespace(name: "const_ptr", scope: !52)
!890 = !DISubroutineType(types: !891)
!891 = !{!864, !6, !9}
!892 = !{!885, !893}
!893 = !DILocalVariable(name: "align", arg: 2, scope: !886, file: !887, line: 1474, type: !9)
!894 = !DILocation(line: 1474, column: 26, scope: !886, inlinedAt: !895)
!895 = !DILocation(line: 127, column: 17, scope: !896, inlinedAt: !883)
!896 = !DILexicalBlockFile(scope: !877, file: !300, discriminator: 0)
!897 = !DILocalVariable(name: "self", arg: 1, scope: !898, file: !887, line: 165, type: !6)
!898 = distinct !DISubprogram(name: "addr<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h4dfb68297494d2e3E", scope: !888, file: !887, line: 165, type: !899, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !430, retainedNodes: !901)
!899 = !DISubroutineType(types: !900)
!900 = !{!9, !6}
!901 = !{!897}
!902 = !DILocation(line: 165, column: 17, scope: !898, inlinedAt: !903)
!903 = !DILocation(line: 1479, column: 14, scope: !886, inlinedAt: !895)
!904 = !DILocalVariable(name: "self", arg: 1, scope: !905, file: !887, line: 65, type: !6)
!905 = distinct !DISubprogram(name: "cast<(), ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h992db89ed6a4342bE", scope: !888, file: !887, line: 65, type: !906, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !909, retainedNodes: !908)
!906 = !DISubroutineType(types: !907)
!907 = !{!6, !6}
!908 = !{!904}
!909 = !{!431, !910}
!910 = !DITemplateTypeParameter(name: "U", type: !7)
!911 = !DILocation(line: 65, column: 26, scope: !905, inlinedAt: !912)
!912 = !DILocation(line: 171, column: 38, scope: !898, inlinedAt: !903)
!913 = !DILocalVariable(name: "self", arg: 1, scope: !914, file: !887, line: 39, type: !6)
!914 = distinct !DISubprogram(name: "is_null<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17hfb161801b0e0e50dE", scope: !888, file: !887, line: 39, type: !915, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !430, retainedNodes: !917)
!915 = !DISubroutineType(types: !916)
!916 = !{!864, !6}
!917 = !{!913}
!918 = !DILocation(line: 39, column: 26, scope: !914, inlinedAt: !919)
!919 = !DILocation(line: 127, column: 57, scope: !896, inlinedAt: !883)
!920 = !DILocalVariable(name: "src", arg: 1, scope: !921, file: !300, line: 146, type: !6)
!921 = distinct !DISubprogram(name: "maybe_is_nonoverlapping", linkageName: "_ZN4core9ub_checks23maybe_is_nonoverlapping17h07bec4703cfe6d33E", scope: !868, file: !300, line: 145, type: !922, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !924)
!922 = !DISubroutineType(types: !923)
!923 = !{!864, !6, !6, !9, !9}
!924 = !{!920, !925, !926, !927}
!925 = !DILocalVariable(name: "dst", arg: 2, scope: !921, file: !300, line: 147, type: !6)
!926 = !DILocalVariable(name: "size", arg: 3, scope: !921, file: !300, line: 148, type: !9)
!927 = !DILocalVariable(name: "count", arg: 4, scope: !921, file: !300, line: 149, type: !9)
!928 = !DILocation(line: 146, column: 5, scope: !921, inlinedAt: !929)
!929 = !DILocation(line: 3747, column: 20, scope: !862)
!930 = !DILocation(line: 148, column: 5, scope: !921, inlinedAt: !929)
!931 = !DILocation(line: 118, column: 5, scope: !867, inlinedAt: !932)
!932 = !DILocation(line: 3746, column: 20, scope: !862)
!933 = !DILocation(line: 3184, column: 40, scope: !877, inlinedAt: !934)
!934 = !DILocation(line: 3196, column: 9, scope: !935, inlinedAt: !932)
!935 = !DILexicalBlockFile(scope: !884, file: !863, discriminator: 4)
!936 = !DILocation(line: 1474, column: 32, scope: !886, inlinedAt: !937)
!937 = !DILocation(line: 127, column: 17, scope: !938, inlinedAt: !934)
!938 = !DILexicalBlockFile(scope: !896, file: !300, discriminator: 2)
!939 = !DILocalVariable(name: "self", arg: 1, scope: !940, file: !682, line: 3360, type: !9)
!940 = distinct !DISubprogram(name: "is_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15is_power_of_two17h36aa1d66525cdc66E", scope: !941, file: !682, line: 3360, type: !942, scopeLine: 3360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !944)
!941 = !DINamespace(name: "{impl#11}", scope: !70)
!942 = !DISubroutineType(types: !943)
!943 = !{!864, !9}
!944 = !{!939}
!945 = !DILocation(line: 3360, column: 38, scope: !940, inlinedAt: !946)
!946 = !DILocation(line: 1475, column: 19, scope: !947, inlinedAt: !937)
!947 = !DILexicalBlockFile(scope: !886, file: !887, discriminator: 2)
!948 = !DILocalVariable(name: "self", arg: 1, scope: !949, file: !682, line: 84, type: !9)
!949 = distinct !DISubprogram(name: "count_ones", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$10count_ones17h30379bec5e758785E", scope: !941, file: !682, line: 84, type: !950, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !107, templateParams: !23, retainedNodes: !952)
!950 = !DISubroutineType(types: !951)
!951 = !{!90, !9}
!952 = !{!948}
!953 = !DILocation(line: 84, column: 33, scope: !949, inlinedAt: !954)
!954 = !DILocation(line: 3361, column: 18, scope: !955, inlinedAt: !946)
!955 = !DILexicalBlockFile(scope: !940, file: !682, discriminator: 2)
!956 = !DILocation(line: 149, column: 5, scope: !921, inlinedAt: !929)
!957 = !DILocation(line: 3744, column: 17, scope: !862)
!958 = !DILocation(line: 118, column: 5, scope: !867, inlinedAt: !875)
!959 = !DILocation(line: 1474, column: 32, scope: !886, inlinedAt: !895)
!960 = !DILocation(line: 3360, column: 38, scope: !940, inlinedAt: !961)
!961 = !DILocation(line: 1475, column: 19, scope: !886, inlinedAt: !895)
